---
kind: other
id: Properties.T:Autodesk.Revit.DB.DocumentPreviewSettings
source: html/8dcd31eb-bdfe-856d-b395-60ab27390fa2.htm
---
# DocumentPreviewSettings Properties

Specifies whether the .NET object represents a valid Revit entity.